n5/src/InformationRegisters/RemoteActions/RemoteActions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RemoteActions</name>
  <resources>
    <name>Action</name>
    <type>
      <types>EnumRef.RemoteActions</types>
    </type>
  </resources>
  <resources>
    <name>Expire</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Parameter1</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Parameter2</name>
    <type>
      <types>Boolean</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/InformationRegisters/RemoteActions/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function Create ( Action, P1 = undefined, P2 = undefined, Expire = undefined ) export

	r = CreateRecordManager ();
	id = new UUID ();
	r.ID = id;
	r.Action = Action;
	r.Parameter1 = P1;
	r.Parameter2 = P2;
	r.Expire = ? ( Expire = undefined, CurrentSessionDate () + Enum.ConstantsRemoteActionExpiration (), Expire );
	r.Write ();
	return Cloud.RemoteActionsService () + "/hs/RemoteActions?ID=" + id;
	
EndFunction

#endif
